/* 값&식&문 */
// 사람과 사람이 대화할때! 문법이 틀려도 어느정도 이해 가능
// SyntaxError일때는 프로그래밍 언어에서 문법을 지키지 않을때는 => 에러발생

/* 값 */
// ● 하나의 값

/* 식 or 표현식(expression) */
// ● 값을 생성
// ● 값으로 귀결


/* 값 (즉, 값 식) */

1 // => numer로 된 값
'문자열 값' // => string으로 된 값 

// 값들
true
false
null
undefined

// .... 레퍼런스 타입 값

// 값으로 귀결된 식 or 연산식
1 + 1
1 > 2
'안' + '녕' +'하세요'

/* 문(statement) */
// ● 행동을 한다.
// ● 흐름을 제어한다.

// 인터프리터에게 명령한다. 그것을 지시문으로
let isFlag = false;

if (1 + 1 > 0) {
    isFlag = true;
}

if (1 + 1 > 0) {
    return 성공;
}

for(){

}

while(식) {

}